app/views/users/show.html.erb

SELECT "venues".* FROM "venues" INNER JOIN "visits" ON "venues"."id" = "visits"."venue_id" WHERE "visits"."user_id" = $1  [["user_id", 12]]
---
  <hr>
  <% @user.venues.each do |v| %>