app/views/venues/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "visits" ON "users"."id" = "visits"."user_id" WHERE "visits"."venue_id" = $1  [["venue_id", 11]]
---
<h4>Users</h4>
<% @venue.users.each do |u| %>