app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY "users"."id" DESC
---
  def index
    @users = User.all.order(id: :desc)

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", 2]]
---
  def visit
    @user = current_user
    @venue = Venue.find(params[:id])

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "age", "profile_pic", "description", "current_city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "profile_pic" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["profile_pic", "http://www.richardfarrar.com/wp-content/uploads/2008/06/mona300-thumb.jpg"], ["updated_at", "2016-06-22 21:46:18.914980"], ["id", 8]]
---
  def update
    @user = User.find(params[:id])
    @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def delete
    @user = User.find(params[:id])
    session.delete(:user_id)