app/controllers/venues_controller.rb

  def index
    if params[:search] != nil
      @venues = Venue.search(params[:search])
    else
      @venues = Venue.all.order(city: :desc)
---
SELECT "venues".* FROM "venues" WHERE (city LIKE '%San Fransisco')
SELECT "venues".* FROM "venues" WHERE "venues"."city" = $1  [["city", "San Fransisco"]]

  def create
    params[:venue][:admin_id] = current_user.id
    @venue = Venue.new(venue_params)
    if @venue.save
---
INSERT INTO "venues" ("name", "street_one", "street_two", "city", "state", "zipcode", "phone_number", "email", "description", "profile_pic", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def show
    @venue = Venue.find(params[:id])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @venue = Venue.find(params[:id])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @venue = Venue.find(params[:id])
    @venue.update_attributes(venue_params)
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "venues" SET "name" = $1, "street_one" = $2, "street_two" = $3, "city" = $4, "state" = $5, "updated_at" = $6 WHERE "venues"."id" = $7  [["name", "ab"], ["street_one", "ab"], ["street_two", "ab"], ["city", "ab"], ["state", "ab"], ["updated_at", "2016-06-22 03:07:45.776300"], ["id", 1]]

  def destroy
    @venue = Venue.find(params[:id])
    @venue.destroy
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "venues" WHERE "venues"."id" = $1  [["id", 1]]